RIET/src/Catalogs/Services/Services.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Services</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CustomFeesAndPenaltiesPaidByCCA</name>
      <description>Custom Fees and Penalties (paid by CCA)</description>
    </items>
  </predefined>
  <attributes>
    <name>DescriptionEng</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SumCalculationMethod</name>
    <type>
      <types>EnumRef.SumCalculationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>AllocationArea</name>
    <type>
      <types>EnumRef.AllocationAreas</types>
    </type>
  </attributes>
  <attributes>
    <name>AllocationMethod</name>
    <type>
      <types>EnumRef.AllocationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>DutiesRecharge</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Local</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ports</name>
    <attributes>
      <name>Port</name>
      <type>
        <types>CatalogRef.SeaAndAirPorts</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/Services/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзService" Тогда
			НастроитьДляВыбораИзService(СтруктураНастройки);
		ИначеЕсли СтруктураНастройки.Имя = "ВыборИзPriceListOfServices" Тогда
			НастроитьДляВыбораИзPriceListOfServices(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзService(СтруктураНастройки)
	
	СтруктураОтбора = Параметры.Отбор;
	Port = СтруктураНастройки.Port;
	Agent = СтруктураНастройки.Agent;
	ДатаПолученияЦены = СтруктураНастройки.ДатаПолученияЦены;
	Если ЗначениеЗаполнено(Agent)
		И ЗначениеЗаполнено(ДатаПолученияЦены) Тогда
		Services = CustomsСервер.ПолучитьМассивServicesДляВыбораИзДокументаService(Port, Agent, ДатаПолученияЦены);
		СтруктураОтбора.Вставить("Ссылка", Services);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзPriceListOfServices(СтруктураНастройки)
	
	СтруктураОтбора = Параметры.Отбор;
	SumCalculationMethod = Перечисления.SumCalculationMethods[СтруктураНастройки.ИмяSumCalculationMethod];
	СтруктураОтбора.Вставить("SumCalculationMethod", SumCalculationMethod);	
	
	СписокИсключенных = Новый СписокЗначений;
	СписокИсключенных.ЗагрузитьЗначения(СтруктураНастройки.CurrentServices);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"Ссылка",
		СписокИсключенных,
		ВидСравненияКомпоновкиДанных.НеВСписке,
		,
		Истина);
		
КонецПроцедуры
